let handler = m => m;

handler.all = async function (m) {
    let chat = global.db.data.chats[m.chat];
    let responses;
    if (/^عاصمة$/i.test(m.text)) {
        responses = [
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة فرنسا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة اليابان؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة ألمانيا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة المغرب؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة الولايات المتحدة؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة مصر؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة إيطاليا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة إسبانيا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة كندا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة روسيا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة الصين؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة البرازيل؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة الأرجنتين؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة السعودية؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة الإمارات؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة أستراليا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة الهند؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة تركيا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة كوريا الجنوبية؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة جنوب أفريقيا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة نيجيريا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة العراق؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة سوريا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة الأردن؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة لبنان؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة قطر؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة الكويت؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة عمان؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة السودان؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة تونس؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة الجزائر؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة ليبيا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة موريتانيا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة الصومال؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة جزر القمر؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة جيبوتي؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة بنين؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة توغو؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة غانا؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة بوركينا فاسو؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة النيجر؟*

*∞──────「عاصمة」──────∞*`,
            `*∞──────「عاصمة」──────∞*

*س: ما هي عاصمة التشاد؟*

*∞──────「عاصمة」──────∞*`

 ];
 }  
 if (responses) { 
 let randomIndex = Math.floor(Math.random() * responses.length); 
 conn.reply(m.chat, responses[randomIndex], m); 
 } 
 return !0 
 }; 

 export default handler;