let handler = m => m; 
  
 handler.all = async function (m) { 
   let chat = global.db.data.chats[m.chat]; 
   let responses; 
   if (/^ايميليا بحبك|ايميليا عاوز اتجوزك|بحبك|بموت فيك|نتجوز|ايميليا هنتجوز امتي|ايميليا انت ليا|ايميليا بموت فيك$/i.test(m.text)) { 
     responses = [ 
       'شكرا  ',  
       'هفكر في الموضوع',  
             'و انا',  
                   'استحيت',  
                         'خلاص لا اتكسف ',  
                               'اسكتتتتت عشان مضربكش عيب الكلام ده   ',  
                                     'طيب و بعدين '  
     ]; 
   }else if (/^ لايت عامل ايه|ايميليا عامله ايه|عاملين ايه|الدنيا عامله ايه|عاملين ايه يشبب$/i.test(m.text)) { 
     responses = [ 
       '🥰كل شيء بخير الحمد لله ',  
          '🌚🐦 مش عارف  ',  
              '🙂 الحمد لله ماشي الحال ',  
                  '❤️الحمد الله',  
                      ' لو انت كويس انا كويس' 
     ]; 
 }else if (/^تم تعريب هذا الامر|تم الانتهاء|تمت اضافه|تمت اضافة|تم التعريب|هذا الامر انتهي$/i.test(m.text)) { 
     responses = [ 
       ' عاشت ايدك ✨💜',  
           'تسلم ايدك ✨💜 ',  
                'عاش ✨💜 ',  
                  'عاش ايميليا ✨💜',  
                   'اوكي ✨💜' 
     ]; 
   }else if (/^لول|هههه|ههههه|هههههه|ههههههه|😹😹😹|هههههههه|😂😂😂$/i.test(m.text)) { 
     responses = [ 
       '😂😂😂❤️دوم دي ضحكة ',  
            ' 🐦ضحكني معاك',  
                   'دوم يا رب ❤️ ',  
                         'ههه🗿 ',  
                         '😂😂😂❤️',  
                         'ايه ال بيضحك🌚',  
                         '🥺❤️اضحك معاك؟',  
                             '🥺❤️دوم ' 
   ]; 
   }else if (/^ايميليا|ايميليا عمتك|يا ايميليا$/i.test(m.text)) { 
     responses = [ 
       'قلب ايميليا من جوا✨🥺♥',  
          'ايش بغيت يا حياتي ✨❤️*🐤',  
              ' قلب ايميليا من جوا✨🥺♥',  
                  'ايش بغيت يا حياتي انت✨🥺♥ ',  
                   ' ايميليا عمتك😩' 
]; 
   }else if (/^بوت|يا بوت|البوت|بوووت|بووووت|بوووووت|بووووووووت $/i.test(m.text)) { 
     responses = [ 
       '*اسمي ايميليا يروحي*✨♥',  
          ' *اسمي ايميليا يعمري*✨♥',  
              ' *اسمي ايميليا يا حيوان*🐦',  
                  '*اسمي ايميليا قولنا*✨💜 ',  
                   ' *هلا انا بوت*✨💜' 
  ]; 
   }else if (/^صباح النور|صباح النعناع الاخصر|صباح الفل|صباح|صباح الخير $/i.test(m.text)) { 
     responses = [ 
       'صباح الفل ✨💜',  
          'صباح النور ✨💜 ',  
              ' صباح الكاريزما ✨💜',  
                  'انت صحيت وانا رايح انام 🐦👋🏻 ',  
                   'روح نام تاني بقي 🙃' 
     ]; 
   }else if (/^شكرا|تسلمي$/i.test(m.text)) { 
     responses = [ 
       'العفو✨🥺♥',  
          ' ولا يهمك مفيش حاجه✨💫 ',  
              ' الشكر لله ✨💜',  
                   'العفو يا باشا ✨💜' 
]; 
   }else if (/^🧡|💚|💞|💖|💜|💛|🤍 $/i.test(m.text)) { 
     responses = [ 
       'شكرا✨♥',  
          'تسلم✨♥',  
              '✨♥',  
                  'حبيبي✨💜',  
                   '✨💜' 
  ]; 
     }else if (/^كل ده نور|الجروب نور كده ليه|ايه النور ده|منورين الجدد|منورين|منور $/i.test(m.text)) { 
     responses = [ 
       'نوري انا✨♥',  
          'الجروب نور فعلا✨♥',  
              '✨♥',  
                  'الجروب منور✨💜',  
                   '✨💜' 
  ]; 
   }else if (/^اسكت|اسكت|هتسكت امتي|يا ابني اسكت$/i.test(m.text)) { 
     responses = [ 
             '🥺💔ملكش دعوه ', 
              '🥺 لا وانت مالك',  
                 '😏 مش بمزاجك',  
                 'لا مين انت ال هتسكتني🗿 ',  
                   '🙃اسكت انت' 
     ]; 
    }  
   if (responses) { 
     let randomIndex = Math.floor(Math.random() * responses.length); 
     conn.reply(m.chat, responses[randomIndex], m); 
   } 
   return !0 
 }; 
  
 export default handler;