let handler = async (m, { command, text }) => m.reply(`*╔═╼─╾─╾═【🩸】═╼─╾╾─╾═╗*
*رد تــلــقــائــي🧑🏻‍💻*
*╔⟐━───━┓🩸┏━───━⟐╗*
*⇜أهلا بك بأستقبال  نقابة┋«AGIAN 🍺
*↵⟦ ✦.✿بـَّـــسْـمِ الْلّٰه الرحَــــمٰــنِٓ الرَّحِـــيـــمِ✿. ✦ ⟧*
*┃❐━──━⌬〘🍺〙⌬━──━❐┃*
*استمارة 📜 دخول 🍺 AGAIN 🍺*

*┃❐━──━⌬〘🍺〙⌬━──━❐┃*

*〖 🔮في وسط غيوم السماء، وبين خيوط أشعة الشمس، وبين أغصان الأزهار وأوراق الأشجار، نحيي ضويفنا الكرام🔮〗* 
*┃❐━──━⌬〘🍺〙⌬━──━❐┃*

*❐ اللــ🍺ــقـب :  _⊑ ⊒_*

*❐ الإنـــــم🔮ـي : _⊑ ⊒_*

*❐ ذكـر/انثـى :  _⊑ ⊒_*

*❐ مـن طـ🎯ـرف ؟ : _⊑ ⊒_*

*❰ ⚠️ مـلاحـظــات⚠️  ❱*

~*✺ إرسال صورة للشخصية يلي بدك لقبها.*~

~*✺ إختيار ألقاب تابعة لإنمي*~
~*✺ ⚠️النقابة مختلطة.⚠️*~
*┃❐━──━⌬〘🍺〙⌬━──━❐┃*
*╚⟐━───━┛🩸┗━───━⟐╝*
*❈↲لملئ الإستمارة يرجى النسخ وملء الفراغات*
*❈↲بعد ملئ الاستمارة منشن احد المشرفين*
*❈↲يرجى ارفاق صورة للقب*
*✦━━━━━━[ ITACHI ]━━━━━━✦`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['استماره <teks>?']
handler.tags = ['استماره', 'fun']
handler.command = /^(استماره)$/i

