let handler = async (m, { command, text }) => m.reply(`ماخوذ`.trim(), null, m.mentionedJid ? {
  mentions: m.mentionedJid
} : {})

handler.help = ['الالقاب <teks>?']
handler.tags = ['fun', 'الاقاب']
handler.command = /^(|اكازا|الوكا|ايانوكوجي-كيوتاكا|ايان-كوجي|ايسكانور|اوبيتو|ايزن|ايتاشي|انوس|اوروما|الكونت اكارد|الدون-ساي|ايوميلا|ايتادوري|ايس|باين|بون|بوتهيل|تنغن|توجي|تاميوكا|تورو|جوجو|جيونك-يو|جوتارو|جورنو-جوفانا|ديو|دازاي|ديلوك|ريوك|رينغوكو|روبين|روجر|راي|زورو|زاراكي|زالاما|زوفان|سانيمي|سوكونا عمك|سيليفيت|سايتاما|سونغ|سابو|ساكورا|سانجي|سوهو|شادو|شينوبو|شينجي|شادو-موث|غاتس|غيومي|غوجو|غيتو|غون|غوكو|غيو|فانغ-يوان|فيجيتا|كاكاشي|كورومي-توكيساكي|كايدو|كيرا|كين-شيرو|لايت|لاو|لوفي|لونادي|هيسوكا|هيناتا|هاكاري-هاتورو|هانجي|هاناجيما-ساكي|مادارا|ميتسوري|ميليودس|كاهوراغا|ماكيما|ميروس|موساشي|نوبرا|نيزوكو|ناخت)$/i

export default handler